Documents/абс_СтраховойЗапас/абс_СтраховойЗапас.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СтраховойЗапас</name>
  <registerRecords>InformationRegister.абс_СтраховойЗапас</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Дней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/абс_СтраховойЗапас/абс_СтраховойЗапас.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СтраховойЗапас</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Дней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/абс_СтраховойЗапас/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.абс_СтраховойЗапас.Записывать = Истина;
	Движения.абс_СтраховойЗапас.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.абс_СтраховойЗапас.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Дней = ТекСтрокаТовары.Дней;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры
